In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/spam_ham_dataset.csv")
df.head()

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0

In [3]:
df = df.drop(["Unnamed: 0", "label"], axis=1)

In [4]:
df.head()

                                                text  label_num
0  Subject: enron methanol ; meter # : 988291\r\n...          0
1  Subject: hpl nom for january 9 , 2001\r\n( see...          0
2  Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3  Subject: photoshop , windows , office . cheap ...          1
4  Subject: re : indian springs\r\nthis deal is t...          0

In [5]:
df.reset_index(inplace=True)

In [6]:
df.head()

   index                                               text  label_num
0      0  Subject: enron methanol ; meter # : 988291\r\n...          0
1      1  Subject: hpl nom for january 9 , 2001\r\n( see...          0
2      2  Subject: neon retreat\r\nho ho ho , we ' re ar...          0
3      3  Subject: photoshop , windows , office . cheap ...          1
4      4  Subject: re : indian springs\r\nthis deal is t...          0

In [7]:
df.shape

(5171, 3)

In [8]:
df.describe()

             index    label_num
count  5171.000000  5171.000000
mean   2585.000000     0.289886
std    1492.883452     0.453753
min       0.000000     0.000000
25%    1292.500000     0.000000
50%    2585.000000     0.000000
75%    3877.500000     1.000000
max    5170.000000     1.000000

In [12]:
df.to_csv("../data/processed_data.csv", index=False)